src/InformationRegisters/ВремяЭкспрессДоставкиФилиалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ВремяЭкспрессДоставкиФилиалов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ВремяЭкспрессДоставкиФилиалов/Ext/ManagerModule.bsl
Функция ПолучитьВремяФилиала(Филиал) Экспорт

	ВремяФилиала = Дата(1,1,1);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВремяЭкспрессДоставкиФилиалов.Время
		|ИЗ
		|	РегистрСведений.ВремяЭкспрессДоставкиФилиалов КАК ВремяЭкспрессДоставкиФилиалов
		|ГДЕ
		|	ВремяЭкспрессДоставкиФилиалов.Филиал = &Филиал";
	
	Запрос.УстановитьПараметр("Филиал", Филиал);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ВремяФилиала = Выборка.Время;
	КонецЕсли;
	
	Возврат ВремяФилиала;
	
КонецФункции

Процедура  УстановитьВремяФилиала(Филиал, ВремяЭД) Экспорт
	
	Если Не ЗначениеЗаполнено(Филиал) Тогда
		Возврат;
	КонецЕсли;
	
	МЗ = РегистрыСведений.ВремяЭкспрессДоставкиФилиалов.СоздатьМенеджерЗаписи();
	МЗ.Филиал = Филиал;
	МЗ.Время  = ВремяЭД;
	МЗ.Записать();
	
КонецПроцедуры
